In [173]:
import pandas as pd
import numpy as np

# Creating a dataframe from an array

In [103]:
# array

data = np.array([[1,6], [3,4], [2,3]])

In [104]:
# DataFrame

df = pd.DataFrame(data, index=['row1', 'row2', 'row3'],
             columns=['col1', 'col2'])

In [105]:
df

      col1  col2
row1     1     6
row2     3     4
row3     2     3

In [106]:
data = [[1,6], [3,4], [2,3]]
data

[[1, 6], [3, 4], [2, 3]]

In [107]:
df = pd.DataFrame(data, index=['row1', 'row2', 'row3'],
             columns=['col1', 'col2'])

In [108]:
df

      col1  col2
row1     1     6
row2     3     4
row3     2     3

In [109]:
Bundesländer = ['NRW', 'Bayern', 'Hessen', 'Sachsen']
Einwohnerzahl = [17925570, 13140183, 6293154, 4056941]

In [110]:
dict_Bundesländer = {'Bundesländer': Bundesländer, 'Einwohnerzahl': Einwohnerzahl}

In [111]:
dict_Bundesländer

{'Bundesländer': ['NRW', 'Bayern', 'Hessen', 'Sachsen'],
 'Einwohnerzahl': [17925570, 13140183, 6293154, 4056941]}

In [112]:
df_Einwohnerzahl = pd.DataFrame(dict_Bundesländer)

In [113]:
df_Einwohnerzahl

  Bundesländer  Einwohnerzahl
0          NRW       17925570
1       Bayern       13140183
2       Hessen        6293154
3      Sachsen        4056941

# Dataframe from csv

In [114]:
df_Arbeit = pd.read_csv('StudentsPerformance.csv')

In [115]:
df_Arbeit.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [116]:
df_Arbeit.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50

In [117]:
df_Arbeit.tail(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
990,male,group E,high school,free/reduced,completed,86,81,75
991,female,group B,some high school,standard,completed,65,82,78
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
994,male,group A,high school,standard,none,63,63,62
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [118]:
df_Arbeit.shape

(1000, 8)

In [119]:
pd.set_option('display.max_rows', 1000)

# Attributes

In [120]:
df_Arbeit.index

RangeIndex(start=0, stop=1000, step=1)

In [121]:
df_Arbeit.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [122]:
df_Arbeit.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

# Methods

In [123]:
df_Arbeit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [124]:
df_Arbeit.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

# Function

In [125]:
len(df_Arbeit)

1000

In [126]:
max(df_Arbeit.index)

999

In [127]:
min(df_Arbeit.index)

0

In [128]:
type(df_Arbeit)

pandas.core.frame.DataFrame

In [129]:
round(df_Arbeit, 2).head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

# Select one Column

In [130]:
df_Arbeit['gender'].head()

0    female
1    female
2    female
3      male
4      male
Name: gender, dtype: object

In [131]:
type(df_Arbeit['gender'].head())

pandas.core.series.Series

In [132]:
df_Arbeit['gender'].index

RangeIndex(start=0, stop=1000, step=1)

# Syntax

In [133]:
df_Arbeit.gender.head()

0    female
1    female
2    female
3      male
4      male
Name: gender, dtype: object

In [134]:
df_Arbeit['math score'].head()

0    72
1    69
2    90
3    47
4    76
Name: math score, dtype: int64

# Multiple Column

In [135]:
df_Arbeit[['gender', 'math score']].head()

   gender  math score
0  female          72
1  female          69
2  female          90
3    male          47
4    male          76

In [136]:
type(df_Arbeit[['gender', 'math score']].head())

pandas.core.frame.DataFrame

In [137]:
df_Arbeit[['math score', 'reading score', 'writing score']].head()

   math score  reading score  writing score
0          72             72             74
1          69             90             88
2          90             95             93
3          47             57             44
4          76             78             75

# Add Column

In [138]:
df_Arbeit['Rechtschreibung'] = 70

In [139]:
df_Arbeit.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Rechtschreibung
0,female,group B,bachelor's degree,standard,none,72,72,74,70
1,female,group C,some college,standard,completed,69,90,88,70
2,female,group B,master's degree,standard,none,90,95,93,70
3,male,group A,associate's degree,free/reduced,none,47,57,44,70
4,male,group C,some college,standard,none,76,78,75,70

In [140]:
Rechtschreibung = np.arange(0, 1000)

In [141]:
len(Rechtschreibung)

1000

In [142]:
df_Arbeit['Rechtschreibung'] = Rechtschreibung
df_Arbeit.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Rechtschreibung
0,female,group B,bachelor's degree,standard,none,72,72,74,0
1,female,group C,some college,standard,completed,69,90,88,1
2,female,group B,master's degree,standard,none,90,95,93,2
3,male,group A,associate's degree,free/reduced,none,47,57,44,3
4,male,group C,some college,standard,none,76,78,75,4

In [143]:
Rechtschreibung_2 = np.random.randint(1, 100, size=1000)

In [144]:
df_Arbeit['Rechtschreibung'] = Rechtschreibung_2
df_Arbeit.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Rechtschreibung
0,female,group B,bachelor's degree,standard,none,72,72,74,36
1,female,group C,some college,standard,completed,69,90,88,54
2,female,group B,master's degree,standard,none,90,95,93,19
3,male,group A,associate's degree,free/reduced,none,47,57,44,60
4,male,group C,some college,standard,none,76,78,75,27

In [145]:
np.random.uniform(1, 100, size=1000)

array([79.49287749,  6.91390123, 21.56811574, 63.0302875 , 12.14050991,
       27.22996192, 80.94242039, 67.46578869, 20.5305717 , 62.8571228 ,
       25.78289055,  8.57594506, 97.88367967, 10.39104606, 34.99745839,
        8.53770601, 83.65613245, 80.69059455, 59.79442707, 90.97264424,
       13.24430448, 37.96831316,  4.15534735, 69.25114347, 78.79413376,
       58.85799082, 68.61481746, 11.52055771,  2.27942524, 80.54998719,
       83.29435958, 18.33522259, 82.119315  , 48.88594523, 21.16588124,
       33.92542533, 74.82291655, 74.32568972, 79.69776752, 72.82744763,
       70.72883829, 74.03900296, 26.09717908, 45.98944766, 55.36185042,
       25.02362157, 21.01012657, 19.41144748, 55.35104441, 61.44957012,
       13.8192935 , 96.30798772, 18.39377712, 48.97840874, 95.76216336,
       15.43258695, 26.75680605, 38.63623135, 44.80438329, 19.61942647,
       90.40307623, 29.17832179, 33.41373257, 90.16237739, 74.15838481,
       65.19748474, 63.18890376, 83.90817882, 87.61029672, 30.85495773,
       59.86151346, 86.3477653 , 46.52590939, 36.3988495 , 61.73584824,
       43.03046433, 27.63130688, 83.35732738, 92.94657706, 73.73441998,
       42.61909905, 97.07708547,  1.98853757,  9.28795688, 74.45554142,
       59.00605826, 29.37595109, 93.51186937, 98.88883957, 34.31224687,
       92.01127299, 33.29745245, 98.33120441, 60.3575413 , 40.93024939,
       40.57723468, 50.67989109,  8.25451914, 49.7447658 , 71.23143691,
       97.34113518, 58.5627913 , 94.11751154, 31.5883865 , 58.66208396,
       29.37573421, 20.02750986, 97.28983283, 40.64283849,  1.31776139,
       67.22776   ,  7.56759976, 67.34739294, 91.38762213, 47.46927301,
        1.46935211, 37.42914067, 51.88538597, 68.65719342, 38.32812714,
       85.46998023, 80.65111972, 25.40298054, 29.57525964, 95.28694593,
       94.87748997, 44.0241085 , 19.50013427, 86.82484671, 18.34567045,
       35.25652068, 40.63883531, 22.40388162, 33.89041463, 65.32576205,
       29.17574095, 13.49648408, 96.84729326, 74.02875891, 58.99866508,
        2.88192868, 16.61699734, 74.22039454, 63.26163954, 46.5531985 ,
       19.90333964, 56.67215053, 61.05423664, 49.14169137, 77.67564471,
       56.60347529, 27.12017579, 49.97252058, 63.61424372,  7.13099564,
       30.66643992, 26.75617276, 55.50729641, 51.51911019,  8.11552151,
       71.42222944, 40.15145774, 38.99236137, 86.22111053,  2.7774618 ,
       25.78509644,  7.08499933, 38.11326237, 13.72478851, 95.74464647,
        2.60045131, 63.03230817, 50.73992606, 16.46988126, 33.84997729,
       76.36149412, 55.29369536, 73.71669588, 83.00895611, 92.41817578,
       17.07801188,  9.41776026, 73.00383542, 44.23976551, 10.64872474,
        7.89346843, 55.60398987, 66.04055745, 46.6230106 , 92.68417554,
       64.03864574, 30.02520236, 99.60965904, 36.04178399, 18.90883299,
       50.90953606, 92.68638323, 33.35279432, 38.62019933,  5.64842551,
        3.23038892, 48.12510064,  3.22367067, 94.63405455, 60.55421647,
       12.50764638, 94.86646942, 23.38995177,  4.08769716, 86.34014997,
       51.96592633, 67.2678635 , 14.50219018, 48.06140789, 22.36883798,
       52.38784697, 67.63355404, 83.99189168, 89.14190481, 34.10692245,
       27.67609172, 92.36891708, 67.27162907, 33.45682395, 75.46749703,
       51.59440588, 98.60754189, 32.55943428, 91.27862595, 38.21150429,
       83.02004934, 13.78402418, 75.75183395, 31.66320042, 86.70152082,
       30.58944367, 94.10295449, 33.16930725,  7.38494546, 75.08313403,
       84.26240983, 98.24066731, 56.66120035,  6.89340424, 16.08237151,
       95.31200153,  6.85755455, 17.95031474, 42.67785147, 39.11675712,
       85.27464743, 71.09170356, 52.41792754, 91.74620632, 61.67663415,
       91.02976532, 91.44899143, 20.19039864, 35.31180148, 27.05247971,
       59.82545841, 43.46691614, 62.35656049, 67.51952659, 47.2642693 ,
       22.32818133, 92.99335379, 31.22123249, 69.20597961, 35.16098025,
       22.11496789, 46.10182201,  2.55712301, 50.75883831, 32.55288184,
       28.56032649, 77.79098895, 53.75997194, 95.41001532, 56.65051226,
       25.0710583 , 79.55341763, 50.50219411, 87.40095168, 88.3359173 ,
       80.78012027, 83.13676708, 15.91945954,  8.00024856, 15.89240998,
       92.98799293, 49.18149462, 93.88985366,  7.02695456, 64.52036021,
       51.79874746, 66.56044251, 15.90471249, 18.13581469, 36.02978895,
       21.7239821 , 24.81507222, 58.87920605,  9.14024191, 21.8499741 ,
       86.97665425, 96.50644227, 86.80254186, 96.62079826, 14.51079635,
       39.81094008,  7.40726987, 99.97889834, 43.49094443, 55.67769169,
       23.95628783, 10.39918709, 43.2345382 , 23.25403772, 20.53724981,
       75.90712725, 36.93698281, 94.48811717, 46.59828114, 68.9477127 ,
       81.06356362, 44.27614238, 14.74111462, 18.26369407, 57.68586206,
       19.17979053,  4.60962004,  4.64739777, 64.4316461 , 12.24458635,
       27.9806068 ,  9.21384581, 79.66853515, 36.33506581, 66.90161945,
       64.72822738,  2.46174898, 28.38889578, 55.98420871, 60.97954776,
       39.00484339, 26.69238039, 61.7599475 , 11.96652581, 65.62448071,
        8.60974669, 96.25841796, 74.33902567, 44.03636769, 89.85280607,
       71.90986418, 30.83538938, 84.80013199, 20.05786366, 82.55802707,
       85.27218419, 91.60756678, 79.44267366,  4.81961703, 36.00050513,
       69.59923795, 29.90634019, 89.38446395, 30.25252517, 63.55990946,
       31.70960251, 29.55602353, 75.22372398, 53.14208526, 98.20806284,
       68.74877057, 70.71340045, 40.3389306 , 90.70477488, 60.9206852 ,
       55.11379692, 55.99095514, 82.61570801, 62.56907803, 25.17140081,
       48.36606415, 85.05505453, 31.24944685,  5.23136667,  7.92343327,
       36.39721138, 81.53932435, 36.91890023, 89.9841335 , 27.16062404,
       86.61959023, 30.28239152, 67.69589609, 25.49684632,  4.28143666,
       39.57515724,  2.37143129, 66.72523608, 52.86392264, 98.99764765,
       80.67639991, 41.18122127,  3.83311838, 44.58105434,  6.36941824,
       32.21995143,  3.5962676 , 48.37010215, 67.24181412, 20.95942891,
       59.83035309, 69.92770588, 79.82120986, 44.70516132, 92.88566257,
       44.29533966, 40.4025099 , 55.88580793, 81.00039118, 66.70517917,
       24.23120371,  9.29054625, 95.42451101, 63.16459191, 90.95423223,
       77.08869626, 51.20263527, 35.77012722, 74.41036704, 50.90675676,
       41.20608105, 29.58886341, 32.1775203 , 87.2652219 , 90.37262306,
       29.74063064, 69.87427281, 76.99859822, 24.41546745, 91.31388406,
       29.61638463, 66.97586253, 63.39569504, 80.99502594, 37.46071129,
       17.74370071, 20.7206656 , 78.45079065, 75.18568297, 22.1129652 ,
       57.7778503 , 91.74594501, 28.84026079, 54.49910141,  3.09636497,
       74.8846058 , 88.77198685, 46.81329254, 32.77919679, 35.12024047,
       36.7177256 , 34.94403788, 45.09114774, 63.25047748, 51.33390745,
       69.86807735,  1.48606041, 66.21790421, 90.18621515, 45.57822752,
       42.22884167, 62.91257728, 72.8322026 , 49.42248555, 92.27593381,
       73.40431465, 41.54476171, 80.42113272, 31.12911178, 70.07124948,
       63.22278528, 48.53938912, 55.44739328, 60.75315776, 78.9285935 ,
       24.04547101, 69.78486253, 16.9853232 , 91.79270021, 58.93426842,
       72.17199018, 43.50853838, 78.52805196, 48.16999481, 62.66896024,
        6.17722239, 91.29495978, 53.6328889 , 29.11727683, 53.97030098,
       73.02603203, 21.91802495, 47.2035883 , 89.69130178, 29.98162685,
       38.68777199, 47.11822313, 67.77920235, 63.11420616, 38.57607276,
       86.7072782 ,  5.85317421, 72.41711765, 87.75389819,  1.61144445,
       83.6090325 , 39.66993006, 26.71232519, 26.42193911, 92.4040994 ,
       67.57633665,  6.55163696,  3.49140832, 65.86128482, 47.7116614 ,
       99.77190951, 35.62359412, 90.41925826, 44.44764038, 46.14806447,
       89.17149096, 21.66761106, 94.95319692, 35.07373929, 50.57138101,
       27.15866146, 39.19018   , 13.93464909,  4.46819978,  8.62000599,
       51.00279529, 29.44045922, 92.05260488, 53.85099504, 80.6544786 ,
       51.1894279 , 36.62282474,  3.2651755 , 88.38093448, 47.88522227,
       12.86529288, 77.49982041,  6.25390343, 75.98878266, 70.44138867,
       42.60031297, 11.65199773, 31.30699801, 25.57486099, 86.96127344,
       43.96092891, 31.07888401, 65.09430895,  4.77469193,  2.0828059 ,
       41.99216429, 84.50013689, 68.31351453, 69.91269999, 61.77893574,
       48.1265301 , 20.64035214,  2.79479201, 55.29577497, 89.87262134,
       74.18392352, 77.61489633,  5.87405607,  5.62400037, 16.09989373,
        4.09778267, 71.15986874, 44.28451353, 60.19760698, 95.76025154,
       98.52566084, 37.08115602, 94.45278045, 12.18722711, 74.38201213,
        4.11234273, 50.15387451, 83.73052736, 68.76059188, 35.44659408,
       59.77379234, 48.15710674, 55.51355032, 70.39518071, 53.22014214,
       28.54017839, 42.72956261, 18.22301882, 84.55560253,  9.00430305,
       17.8229272 , 88.31857218,  2.77683356, 53.64520745, 96.79368011,
       18.2904106 , 36.49306152, 76.41362536, 41.04414323, 63.92275668,
       93.23745637, 46.1946388 , 19.51794911, 71.79108726, 45.86058356,
       60.26939772, 48.15302089, 32.06457497, 83.23869155, 70.96227447,
       23.57467413,  1.82358773,  6.96582307, 59.92509118, 45.41432963,
        9.17262082, 25.50880755, 87.2875693 ,  1.71568567,  7.63950262,
       83.79902824, 32.21507779, 48.64784043, 57.59447413, 75.03642942,
       17.77246585, 18.45670498, 91.27635359, 41.58243583, 10.93775503,
       23.90970558, 51.8337096 , 82.71573247, 16.57357136, 54.43470004,
       61.77410463, 62.99971953, 13.18362283, 74.83497099, 69.46612234,
       67.0063909 , 76.80610409, 27.01034727, 54.06943575, 31.88602708,
       30.66720276,  7.88258588, 46.4499886 , 70.91374778, 98.18204756,
        1.0575841 , 73.32241912, 78.10286616, 54.29081947, 75.2282741 ,
       56.86212833, 93.2294464 , 84.56780523, 54.21578996, 73.77342018,
       73.33588623, 55.94854939, 13.52796713, 59.41178373, 72.40665428,
       92.8880178 , 81.56826282, 93.66159994,  4.33154461,  4.763385  ,
       39.53636776, 43.39310285, 21.75813796, 19.49808402, 92.92398627,
       66.96707024, 38.27822892,  5.78580477, 17.93192764, 49.64429936,
       37.07961879,  2.43366829, 18.35523804, 78.38225707, 50.96137329,
       49.85191768, 21.04959696, 47.46857679, 99.39775617, 71.4808415 ,
        7.96730425, 80.3533864 , 26.23342856, 70.70800284, 46.72446715,
       69.56171131, 63.04480902, 12.86056427, 63.55468738, 23.5088325 ,
       15.15870547, 73.47368653, 70.81991248, 82.46375574,  2.74238286,
       11.89518077, 68.43131776, 88.14919777, 58.34951073, 31.79732207,
       17.45471327, 96.51610152, 15.26543971, 53.32785151, 35.32412266,
       74.85569873, 67.18180431,  6.73692426, 99.2078422 , 67.63035572,
       90.88572073, 89.7009968 , 50.28451537, 24.69101633, 94.63372756,
       94.69027716, 22.92032885, 72.5340648 , 56.08891712, 97.33436255,
       45.15675439, 89.19363377,  7.79063179,  6.26620093, 58.53943456,
       19.95239859, 66.59782108, 59.17327277, 21.71991101, 26.77156299,
       45.18643647, 23.52170355, 25.52781869,  7.40638066, 77.54011214,
       67.72498514, 45.02591893, 78.78481075, 80.49213286, 53.2835275 ,
       44.32014366,  3.1344305 , 44.11499129, 53.38412142, 34.99508363,
       55.76402268,  5.89677655, 95.55326367, 66.25204243, 10.87725766,
       94.57541986, 23.61468023, 66.61564454, 17.7714886 , 34.43260627,
       75.27727281,  2.63457765,  4.94147195,  7.50757731, 25.64696625,
       86.52746279, 39.49695307, 80.90871551, 34.34365356, 29.1282713 ,
        5.99934472, 15.63897676, 72.6703998 ,  5.32813699, 43.62902507,
       38.53367398,  3.40844563, 31.76703727, 47.05215984,  4.06925714,
       68.85161337, 32.83251897, 55.52673701, 60.42228987, 52.39356927,
       12.37919081, 67.96288844, 23.69803017, 48.33234802, 90.020181  ,
       94.3853009 ,  6.97764219, 83.98646129, 70.68572029, 64.44776147,
       31.33256359, 60.8779761 , 14.9030842 , 99.29978555, 67.08330867,
       99.11387118, 87.21020168, 64.55362873, 74.46640832, 16.81354952,
        6.55036576, 17.96345382, 77.90443854, 51.40913037, 10.93526375,
       17.69219751, 81.7304998 , 69.98734337, 68.23934078, 12.59929077,
        5.37149885, 19.41116401, 44.11714042, 10.08705686, 45.17490589,
       35.62666477,  3.70077755, 71.94577368, 32.73992232, 23.79381267,
       42.57008232, 91.70797451, 48.84975578, 34.91173713,  8.46611818,
       22.46466272, 53.16330154, 80.64733886, 20.19297471,  5.48332988,
       25.14930567, 46.70956914, 48.14671695, 18.65698685, 46.94216165,
       86.24209154, 51.03327656, 36.1872304 , 67.12482363, 48.93538887,
       37.3870519 ,  7.14029718, 27.47729322, 16.87960451, 15.54120079,
       60.43615469, 53.37843407, 67.98203062, 86.26317802, 95.26099726,
       77.38108803, 49.74467963, 87.8549569 , 73.72286646, 95.02853997,
       98.50856676, 17.34336307, 69.90716313, 82.20257624, 88.81922164,
       22.57525702, 20.75822234, 59.35875096, 82.10093602, 73.52527586,
       10.89719341, 97.10945677, 67.36453987, 19.51807936, 20.35092061,
       58.13126602, 11.11398896, 12.81726212, 91.41011354, 48.41368808,
       19.55603255, 63.20960134, 13.37982139, 61.17289351, 80.17395985,
       85.64527746, 33.82075454, 26.74395068, 83.72956509, 36.63094713,
       64.65271015,  2.22536811, 44.3560936 , 54.35800227, 62.40878769,
       26.26315991, 56.06576959, 78.37555711, 36.63983714, 82.95778338,
       32.46427035, 45.07291028, 30.08908673, 13.99991703, 45.05729023,
       78.48768757, 78.06070102, 43.84394539, 85.20470919, 32.99955908,
       38.31753754, 74.38621466, 46.26841283, 27.57715965, 93.35993266,
       84.23330351, 28.92282131, 10.2870372 , 69.95773205,  9.11134073,
       49.43889915, 32.4050219 ,  6.69173998,  7.80706772, 80.38149098,
       67.85967745, 40.14421561, 98.47261785,  2.23705312, 62.63834562,
       72.86328619, 54.79662951, 92.13337706, 24.93713603, 41.4527697 ,
        8.97899953,  6.96993244, 99.71952672, 54.30409092,  9.81152922,
       33.88295948, 65.95663621, 65.75846043, 16.43950336, 13.53466828,
       87.6003211 , 75.22440895, 53.14673277, 14.4824598 ,  6.92040924,
       80.73572638, 89.73970677, 90.71366468, 83.79347139, 27.69571715,
       70.92283012, 72.45575127, 99.70218253, 27.76528257, 48.28907174,
       36.24271459, 18.7741518 , 99.2531689 , 44.0929295 , 20.33024608,
        7.43504147, 55.90535898, 47.21703057, 38.25203689, 28.6861861 ,
       24.25025795, 24.95092342, 85.21254484, 74.68289208, 90.51938041])

# Math Operations

In [146]:
df_Arbeit['math score'].sum()

66089

In [147]:
print(df_Arbeit['math score'].count())
print(df_Arbeit['math score'].mean())
print(df_Arbeit['math score'].std())
print(df_Arbeit['math score'].max())
print(df_Arbeit['math score'].min())

1000
66.089
15.16308009600945
100
0

In [148]:
df_Arbeit.describe()

       math score  reading score  writing score  Rechtschreibung
count  1000.00000    1000.000000    1000.000000      1000.000000
mean     66.08900      69.169000      68.054000        50.266000
std      15.16308      14.600192      15.195657        28.527725
min       0.00000      17.000000      10.000000         1.000000
25%      57.00000      59.000000      57.750000        26.000000
50%      66.00000      70.000000      69.000000        51.000000
75%      77.00000      79.000000      79.000000        75.000000
max     100.00000     100.000000     100.000000        99.000000

In [149]:
(df_Arbeit['math score'] + df_Arbeit['reading score'] + df_Arbeit['writing score']).head()

0    218
1    247
2    278
3    148
4    229
dtype: int64

In [150]:
df_Arbeit['Durchschnittliches ergebniss'] = (df_Arbeit['math score'] + df_Arbeit['reading score'] + df_Arbeit['writing score'])/3

In [151]:
df_Arbeit.head().round(2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Rechtschreibung,Durchschnittliches ergebniss
0,female,group B,bachelor's degree,standard,none,72,72,74,36,72.67
1,female,group C,some college,standard,completed,69,90,88,54,82.33
2,female,group B,master's degree,standard,none,90,95,93,19,92.67
3,male,group A,associate's degree,free/reduced,none,47,57,44,60,49.33
4,male,group C,some college,standard,none,76,78,75,27,76.33

# Value Counts

In [152]:
len(df_Arbeit['gender'])

1000

In [153]:
df_Arbeit['gender'].count()

1000

In [154]:
df_Arbeit['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

In [155]:
df_Arbeit['gender'].value_counts(normalize=True)

female    0.518
male      0.482
Name: gender, dtype: float64

In [156]:
df_Arbeit['parental level of education'].value_counts()

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

In [157]:
df_Arbeit['parental level of education'].value_counts(normalize=True).round(2)

some college          0.23
associate's degree    0.22
high school           0.20
some high school      0.18
bachelor's degree     0.12
master's degree       0.06
Name: parental level of education, dtype: float64

# Sort DataFrame

In [158]:
df_Arbeit.sort_values(by='math score', ascending=False).head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Rechtschreibung,Durchschnittliches ergebniss
962,female,group E,associate's degree,standard,none,100,100,100,8,100.000000
625,male,group D,some college,standard,completed,100,97,99,84,98.666667
458,female,group E,bachelor's degree,standard,none,100,100,100,80,100.000000
623,male,group A,some college,standard,completed,100,96,86,31,94.000000
451,female,group E,some college,standard,none,100,92,97,65,96.333333

In [159]:
df_Arbeit.sort_values(['math score', 'reading score', 'writing score'] , ascending=False).head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Rechtschreibung,Durchschnittliches ergebniss
458,female,group E,bachelor's degree,standard,none,100,100,100,80,100.000000
916,male,group E,bachelor's degree,standard,completed,100,100,100,27,100.000000
962,female,group E,associate's degree,standard,none,100,100,100,8,100.000000
149,male,group E,associate's degree,free/reduced,completed,100,100,93,89,97.666667
625,male,group D,some college,standard,completed,100,97,99,84,98.666667

In [160]:
df_Arbeit.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Rechtschreibung,Durchschnittliches ergebniss
0,female,group B,bachelor's degree,standard,none,72,72,74,36,72.666667
1,female,group C,some college,standard,completed,69,90,88,54,82.333333
2,female,group B,master's degree,standard,none,90,95,93,19,92.666667
3,male,group A,associate's degree,free/reduced,none,47,57,44,60,49.333333
4,male,group C,some college,standard,none,76,78,75,27,76.333333

In [161]:
df_Arbeit.sort_values(['math score', 'reading score', 'writing score'] , ascending=False,
                      inplace=True)

In [162]:
df_Arbeit.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Rechtschreibung,Durchschnittliches ergebniss
458,female,group E,bachelor's degree,standard,none,100,100,100,80,100.000000
916,male,group E,bachelor's degree,standard,completed,100,100,100,27,100.000000
962,female,group E,associate's degree,standard,none,100,100,100,8,100.000000
149,male,group E,associate's degree,free/reduced,completed,100,100,93,89,97.666667
625,male,group D,some college,standard,completed,100,97,99,84,98.666667

In [182]:
df_Arbeit.sort_values('race/ethnicity', ascending=True).head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Rechtschreibung,Durchschnittliches ergebniss
688,male,group A,high school,free/reduced,none,53,58,44,7,51.666667
365,male,group A,bachelor's degree,free/reduced,completed,49,58,60,65,55.666667
769,male,group A,some college,free/reduced,none,58,60,57,53,58.333333
490,female,group A,associate's degree,free/reduced,none,65,85,76,56,75.333333
820,female,group A,some high school,standard,completed,85,90,92,56,89.000000